IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/AES_1.0.xml
    </group>
    <group id="AES_INT_EVENT1" name="AES_INT_EVENT1" instances="1" offset="0x1050" instaddr="0x30" description="">
        <register id="AES_INT_EVENT1_IIDX" width="32" offset="0x0" description="Interrupt Index Register">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="DMA0" value="0x2" description="AES trigger 0 DMA"/>
            </bitfield>
        </register>
        <register id="AES_INT_EVENT1_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="DMA0" description="DMA0 event mask." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
        </register>
        <register id="AES_INT_EVENT1_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="DMA0" description="DMA0 event" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
        </register>
        <register id="AES_INT_EVENT1_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="DMA0" description="DMA0 event" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
        </register>
        <register id="AES_INT_EVENT1_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="DMA0" description="DMA0" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
        </register>
        <register id="AES_INT_EVENT1_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="DMA0" description="DMA0 event" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
        </register>
    </group>
    <group id="AES_INT_EVENT2" name="AES_INT_EVENT2" instances="1" offset="0x1080" instaddr="0x30" description="">
        <register id="AES_INT_EVENT2_IIDX" width="32" offset="0x0" description="Interrupt Index Register">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="DMA1" value="0x3" description="AES trigger 1 DMA"/>
            </bitfield>
        </register>
        <register id="AES_INT_EVENT2_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="DMA1" description="DMA1 event mask." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
        </register>
        <register id="AES_INT_EVENT2_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="DMA1" description="DMA1 event" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
        </register>
        <register id="AES_INT_EVENT2_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="DMA1" description="DMA1 event" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
        </register>
        <register id="AES_INT_EVENT2_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="DMA1" description="DMA1 event" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
        </register>
        <register id="AES_INT_EVENT2_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="DMA1" description="DMA1 event" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
        </register>
    </group>
    <group id="AES_INT_EVENT3" name="AES_INT_EVENT3" instances="1" offset="0x10B0" instaddr="0x30" description="">
        <register id="AES_INT_EVENT3_IIDX" width="32" offset="0x0" description="Interrupt Index Register">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="DMA2" value="0x4" description="AES trigger 2 DMA"/>
            </bitfield>
        </register>
        <register id="AES_INT_EVENT3_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="DMA2" description="DMA2 event mask." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
        </register>
        <register id="AES_INT_EVENT3_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="DMA2" description="DMA2 event" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
        </register>
        <register id="AES_INT_EVENT3_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="DMA2" description="DMA2 event" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
        </register>
        <register id="AES_INT_EVENT3_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="DMA2" description="DMA2 event" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
        </register>
        <register id="AES_INT_EVENT3_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="DMA2" description="DMA2 event" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
        </register>
