IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/AES_1.0.xml
    </group>
    <register id="AES_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="INT0_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT0]" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT1_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT1]" begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT2_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT2]" begin="5" end="4" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT3_CFG" description="Event line mode select for event corresponding to [IPSTANDARD.INT_EVENT2]" begin="7" end="6" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <register id="AES_AESACTL0" width="32" offset="0x1100" description="AES accelerator control register 0">
        <bitfield id="OPx" description="AES operation.
The AESOPx bits are not reset by AESSWRST = 1. Writes are ignored when AESCMEN = 1 and AESBLKCNTx &gt; 0.
00b = Encryption.
01b = Decryption. The provided key is the same key used for encryption.
10b = Generate first round key required for decryption.
11b = Decryption. The provided key is the first round key required for decryption." begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="OP0" value="0x0" description="Encryption"/>
            <bitenum id="OP1" value="0x1" description="Decryption. The provided key is the same key used for encryption."/>
            <bitenum id="OP2" value="0x2" description="Generate first round key required for decryption."/>
            <bitenum id="OP3" value="0x3" description="Decryption. The provided key is the first round key required for decryption."/>
        </bitfield>
        <bitfield id="KLx" description="AES key length. 
These bits define which of the 1 AES standards is performed. The AESKLx bits are not reset by AESSWRST = 1. Writes are ignored when AESCMEN = 1 and AESBLKCNTx &gt; 0." begin="3" end="2" width="2" rwaccess="R/W">
            <bitenum id="AES128" value="0x0" description="The key size is 128 bit."/>
            <bitenum id="AES256" value="0x2" description="The key size is 256 bit."/>
        </bitfield>
        <bitfield id="CMx" description="AES cipher mode select. These bits are ignored for AESCMEN = 0. Writes are ignored when AESCMEN = 1 and AESBLKCNTx &gt; 0.
00b = ECB
01b = CBC
10b = OFB
11b = CFB" begin="6" end="5" width="2" rwaccess="R/W">
            <bitenum id="ECB" value="0x0" description="ECB"/>
            <bitenum id="CBC" value="0x1" description="CBC"/>
            <bitenum id="OFB" value="0x2" description="OFB"/>
            <bitenum id="CFB" value="0x3" description="CFB"/>
        </bitfield>
        <bitfield id="SWRST" description="AES software reset. 
Immediately resets the complete AES accelerator module even when busy except for the AESRDYIE, the AESKLx and the AESOPx bits. It also clears the (internal) state memory. The AESSWRST bit is automatically reset and is always read as zero.
0b = No reset
1b = Reset AES accelerator module" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="NORST" value="0x0" description="No reset."/>
            <bitenum id="RST" value="0x1" description="Reset AES accelerator module."/>
        </bitfield>
        <bitfield id="ERRFG" description="AES error flag. 
AESAKEY or AESADIN were written while an AES operation was in progress. The bit must be cleared by software.
0b = No error
1b = Error occurred" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="NOERR" value="0x0" description="No error"/>
            <bitenum id="ERR" value="0x1" description="Error occurred"/>
        </bitfield>
        <bitfield id="CMEN" description="AESCMEN enables the support of the cipher modes ECB, CBC, OFB and CFB together with the DMA. Writes are ignored when AESCMEN = 1 and AESBLKCNTx &gt; 0.
0 = No DMA triggers are generated.
1 = DMA cipher mode support operation is enabled and the corresponding DMA triggers are generated." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No DMA triggers are generated."/>
            <bitenum id="ENABLE" value="0x1" description="DMA cipher mode support operation is enabled and the corresponding DMA triggers are generated."/>
        </bitfield>
    </register>
    <register id="AES_AESACTL1" width="32" offset="0x1104" description="AES accelerator control register 1">
        <bitfield id="BLKCNTx" description="Cipher Block Counter. Number of blocks to be encrypted or decrypted with block cipher modes enabled (AESCMEN = 1). Ignored if AESCMEN = 0. The block counter decrements with each performed encryption or decryption. Writes are ignored when AESCMEN = 1 and AESBLKCNTx &gt; 0." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINNUM" value="0x0" description="Smallest value"/>
            <bitenum id="ENABLE" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
