IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/AES_1.0.xml
    <register id="AES_AESASTAT" width="32" offset="0x1108" description="aes accelerator status register">
        <bitfield id="BUSY" description="AES accelerator module busy; encryption, decryption, or key generation in progress. 
0 = Not busy 
1 = Busy" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="IDLE" value="0x0" description="Not busy"/>
            <bitenum id="BUSY" value="0x1" description="Busy"/>
        </bitfield>
        <bitfield id="KEYWR" description="All bytes written to AESAKEY. This bit can be modified by software but it must not be reset by software (10) if AESCMEN=1. Changing its state by software also resets the AESKEYCNTx bits. AESKEYWR is reset by PUC, AESSWRST, an error condition, changing AESOPx, changing AESKLx, and the start to (over)write a new key. Because it is reset when AESOPx is changed it can be set by software again to indicate that the loaded key is still valid." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NALL" value="0x0" description="Not all bytes written"/>
            <bitenum id="ALL" value="0x1" description="All bytes written"/>
        </bitfield>
        <bitfield id="DINWR" description="All 16 bytes written to AESADIN, AESAXDIN or AESAXIN. Changing its state by software also resets the AESDINCNTx bits. AESDINWR is reset by PUC, AESSWRST, an error condition, changing AESOPx, changing AESKLx, the start to (over)write the data, and when the AES accelerator is busy. Because it is reset when AESOPx or AESKLx is changed it can be set by software again to indicate that the current data is still valid. 
0 = Not all bytes written 
1 = All bytes written" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NALL" value="0x0" description="Not all bytes written"/>
            <bitenum id="ALL" value="0x1" description="All bytes written"/>
        </bitfield>
        <bitfield id="DOUTRD" description="All 16 bytes read from AESADOUT. AESDOUTRD is reset by PUC, AESSWRST, an error condition, changing AESOPx, changing AESKLx, when the AES accelerator is busy, and when the output data is read again. 
0 = Not all bytes read
1 = All bytes read" begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="NALL" value="0x0" description="Not all bytes read"/>
            <bitenum id="ALL" value="0x1" description="All bytes read"/>
        </bitfield>
        <bitfield id="KEYCNTx" description="Bytes written to AESAKEY when AESKLx = 00, half-words written to AESAKEY if AESKLx = b10. Reset when AESKEYWR is reset. If AESKEYCNTx = 0 and AESKEYWR = 0, no bytes were written. If AESKEYCNTx = 0 and AESKEYWR = 1, all bytes were written." begin="7" end="4" width="4" rwaccess="R">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DINCNTx" description="Bytes written to AESADIN, AESAXDIN or AESAXIN. Reset when AESDINWR is reset. If AESDINCNTx = 0 and AESDINWR = 0, no bytes were written. If AESDINCNTx = 0 and AESDINWR = 1, all bytes were written." begin="11" end="8" width="4" rwaccess="R">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DOUTCNTx" description="Bytes read from AESADOUT. Reset when AESDOUTRD is reset. If AESDOUTCNTx = 0 and AESDOUTRD = 0, no bytes were read. If AESDOUTCNTx = 0 and AESDOUTRD = 1, all bytes were read." begin="15" end="12" width="4" rwaccess="R">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="AES_AESAKEY" width="32" offset="0x110C" description="aes accelerator key register">
        <bitfield id="KEY0x" description="AES key byte n when AESAKEY is written as word. AES next key byte when AESAKEY is written as byte. Do not mix word and byte access. Always reads as zero. The key is reset by PUC or by AESSWRST = 1." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="KEY1x" description="AES key byte n+1 when AESAKEY is written as word. Do not use these bits for byte access. Do not mix word and byte access. Always reads as zero. The key is reset by PUC or by AESSWRST = 1." begin="15" end="8" width="8" rwaccess="R/W">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="KEY2x" description="AES key byte n+2 when AESAKEY is written as word. Do not use these bits for byte access. Do not mix word and byte access. Always reads as zero. The key is reset by PUC or by AESSWRST = 1." begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="KEY3x" description="AES key byte n+3 when AESAKEY is written as word. Do not use these bits for byte access. Do not mix word and byte access. Always reads as zero. The key is reset by PUC or by AESSWRST = 1." begin="31" end="24" width="8" rwaccess="R/W">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="AES_AESADIN" width="32" offset="0x1110" description="aes accelerator data in register">
        <bitfield id="DIN0x" description="AES data in byte n when AESADIN is written as word. AES next data in byte when AESADIN is written as byte. Do not mix word and byte access. Always reads as zero." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DIN1x" description="AES data in byte n+1 when AESADIN is written as word. Do not use these bits for byte access. Do not mix word and byte access. Always reads as zero." begin="15" end="8" width="8" rwaccess="R/W">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DIN2x" description="AES data in byte n+2 when AESADIN is written as word. Do not use these bits for byte access. Do not mix word and byte access. Always reads as zero." begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DIN3x" description="AES data in byte n+3 when AESADIN is written as word. Do not use these bits for byte access. Do not mix word and byte access. Always reads as zero." begin="31" end="24" width="8" rwaccess="R/W">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="AES_AESADOUT" width="32" offset="0x1114" description="aes accelerator data out register">
        <bitfield id="DOUT0x" description="AES data out byte n when AESADOUT is read as word. AES next data out byte when AESADOUT is read as byte. Do not mix word and byte access." begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DOUT1x" description="AES data out byte n+1 when AESADOUT is read as word. Do not use these bits for byte access. Do not mix word and byte access." begin="15" end="8" width="8" rwaccess="R">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DOUT2x" description="AES data out byte n+2 when AESADOUT is read as word. Do not use these bits for byte access. Do not mix word and byte access." begin="23" end="16" width="8" rwaccess="R">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DOUT3x" description="AES data out byte n+3 when AESADOUT is read as word. Do not use these bits for byte access. Do not mix word and byte access." begin="31" end="24" width="8" rwaccess="R">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="AES_AESAXDIN" width="32" offset="0x1118" description="aes accelerator xored data in register">
        <bitfield id="XDIN0x" description="AES data in byte n when AESAXDIN is written as word. AES next data in byte when AESAXDIN is written as byte. Do not mix word and byte access. Always reads as zero." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="XDIN1x" description="AES data in byte n+1 when AESAXDIN is written as word. Do not use these bits for byte access. Do not mix word and byte access. Always reads as zero." begin="15" end="8" width="8" rwaccess="R/W">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="XDIN2x" description="AES data in byte n+2 when AESAXDIN is written as word. Do not use these bits for byte access. Do not mix word and byte access. Always reads as zero." begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="XDIN3x" description="AES data in byte n+3 when AESAXDIN is written as word. Do not use these bits for byte access. Do not mix word and byte access. Always reads as zero." begin="31" end="24" width="8" rwaccess="R/W">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="AES_AESAXIN" width="32" offset="0x111C" description="aes accelerator xored data in register (no trigger)">
        <bitfield id="XIN0x" description="AES data in byte n when AESAXIN is written as word. AES next data in byte when AESAXIN is written as byte. Do not mix word and byte access. Always reads as zero." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="XIN1x" description="AES data in byte n+1 when AESAXIN is written as word. Do not use these bits for byte access. Do not mix word and byte access. Always reads as zero." begin="15" end="8" width="8" rwaccess="R/W">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="XIN2x" description="AES data in byte n+2 when AESAXIN is written as word. Do not use these bits for byte access. Do not mix word and byte access. Always reads as zero." begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="XIN3x" description="AES data in byte n+3 when AESAXIN is written as word. Do not use these bits for byte access. Do not mix word and byte access. Always reads as zero." begin="31" end="24" width="8" rwaccess="R/W">
            <bitenum id="MINNUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXNUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
</module>
